In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name':["Sam","Roma","Mark"], "profession":['dev','mle','Data scientist'],
                   "gender":['male','female','male'], 
                   "age":[21,20,25],
                   "review":['No comments','hardworker','need improvement'],"rating":[10,5,7]})

In [3]:
df

   name      profession  gender  age            review  rating
0   Sam             dev    male   21       No comments      10
1  Roma             mle  female   20        hardworker       5
2  Mark  Data scientist    male   25  need improvement       7

In [9]:
df1 = df[df['rating']>= 6]

In [13]:
df1[['profession','gender','age']]

       profession gender  age
0             dev   male   21
2  Data scientist   male   25

In [14]:
df_new = pd.DataFrame({'name':['bruno','ariana','henry','selena','weekend'],
                      'gender':['m','f','m','f','m'],
                      'income':['low','high','medium','medium','medium']})

In [15]:
df_new

      name gender  income
0    bruno      m     low
1   ariana      f    high
2    henry      m  medium
3   selena      f  medium
4  weekend      m  medium

In [21]:
df_greater = df_new[df_new['income']=='medium']
df_greater

      name gender  income
2    henry      m  medium
3   selena      f  medium
4  weekend      m  medium

In [30]:
100*df_greater.shape[0]/df_new.shape[0]

60.0

5

In [29]:
3/5*100

60.0

In [31]:
import pandas as pd  
df1 = pd.DataFrame({"name": ['tobey', 'peter', 'chris', 'pratt'],'chem_score':[10, 9, 8, 7], 'phy_score':[7, 8, 9, 10], 'Hindi_score':[9, 9, 9, 9]})  
df2 = pd.DataFrame({"name": ['chris', 'pratt', 'andrew', 'tom'],'chem_score':[10, 10, 10, 9], 'maths_score':[6, 6, 7, 9], 'eng_score':[9, 10, 10, 9]})

In [35]:
df1

    name  chem_score  phy_score  Hindi_score
0  tobey          10          7            9
1  peter           9          8            9
2  chris           8          9            9
3  pratt           7         10            9

In [36]:
df2

     name  chem_score  maths_score  eng_score
0   chris          10            6          9
1   pratt          10            6         10
2  andrew          10            7         10
3     tom           9            9          9

In [40]:
(df1['chem_score'].mean() + df2['chem_score'].mean())/2

9.125

9.75

In [ ]:
#df.values.tolist()

In [67]:
df3 = pd.merge(df1, df2, on='name')
df4 = df3.mean(axis=1)

C:\Users\yogin\AppData\Local\Temp\ipykernel_6552\2127496414.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df4 = df3.mean(axis=1)

In [68]:
df4.values.tolist()

[8.5, 8.666666666666666]

In [70]:
df1 = pd.DataFrame({'name': ['Jack','Ryan','Chris','Sam'],
'rank': [1, 2, 3, 4]})
df2 = pd.DataFrame({'name': ['Ryan', 'Sam', 'Chris', 'Jack'],
'rank': [3, 1, 4, 2]})

pd.merge(df1,df2, on="name")

    name  rank_x  rank_y
0   Jack       1       2
1   Ryan       2       3
2  Chris       3       4
3    Sam       4       1

In [71]:
df = pd.DataFrame({'cust_id':[101,102,103,104],
                  'name':['rick','morty','pickle','jerry']})

In [79]:
print(df.isin([101, 102, 120]))
print('-'*100)
print(df.isin({'cust_id': [101, 102]}))
print('-'*100)
print(df.isin(df.cust_id))
print('-'*100)
print(df.name.isin('rick'))

   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False
----------------------------------------------------------------------------------------------------
   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False
----------------------------------------------------------------------------------------------------
   cust_id   name
0     True  False
1     True  False
2     True  False
3     True  False
----------------------------------------------------------------------------------------------------

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [str]

In [82]:
# creating the dataframe
df = pd.DataFrame({'a':[3,4,5,6],'b':[22,2,3,3]})

In [83]:
df

   a   b
0  3  22
1  4   2
2  5   3
3  6   3

In [86]:
df['a']/df['b']

0    0.136364
1    2.000000
2    1.666667
3    2.000000
dtype: float64